10/data/attachments/5b836ff7a3bc4049.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Ian_huge_Friend_26688_2</nif:username>
            <nif:friendToBeRequested>soap_friends_13104b59-5eae-48e4-b3f4-b08c7f84fd6e</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>